Catalogs/абс_ХозяйственныеОперацииПУБ77/абс_ХозяйственныеОперацииПУБ77.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ХозяйственныеОперацииПУБ77</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_ТипыОбъектовОбменаПУБ77</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

CommonModules/абс_ПроцедурыСПовторнымВызовом/Module.bsl
Функция ПолучитьХозяйственнуюОперациюДляДокументаПоУмолчанию(ИмяДокумента) Экспорт
	
	//Возврат Неопределено;
	
	ТипДокумента = Тип("ДокументСсылка." + ИмяДокумента);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ХозяйственныеОперацииПУБ77.Ссылка
	|ИЗ
	|	Справочник.абс_ХозяйственныеОперацииПУБ77 КАК абс_ХозяйственныеОперацииПУБ77
	|ГДЕ
	|	абс_ХозяйственныеОперацииПУБ77.ТипМетаданных.ТипМетаданныхСсылка = &ТипЗначенияПустаяСсылка
	|	И абс_ХозяйственныеОперацииПУБ77.ОсновнаяНастройка");
	
	Запрос.УстановитьПараметр("ТипЗначенияПустаяСсылка", Новый(Тип("ДокументСсылка." + ИмяДокумента)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
